In [67]:
import pandas as pd
from sklearn import linear_model

In [68]:
df=pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [69]:
df.experience=df.experience.fillna('Zero')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       Zero                    8.0                           9      50000
1       Zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [70]:
import math
mean=math.floor(df['test_score(out of 10)'].mean())

In [71]:
df['test_score(out of 10)']=df['test_score(out of 10)'].fillna(mean)
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       Zero                    8.0                           9      50000
1       Zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    7.0                           7      72000
7     eleven                    7.0                           8      80000

In [72]:
reg=linear_model.LinearRegression()
reg.fit(df[['test_score(out of 10)', 'interview_score(out of 10)']], df['salary($)'])

LinearRegression()

In [73]:
reg.predict([[7, 7]])

array([63257.75656325])

In [74]:
reg.coef_

array([-786.39618138,  379.47494033])

In [75]:
reg.intercept_

66106.20525059666